[{"_id":"5ff63caec07c64a6f6794700","term":"Фронтeнд","definition":"Клиентская часть веб-приложения, интерфейс для работы с приложением."},{"_id":"5ff63caec07c6429fb794701","term":"JavaScript","definition":"Это легковесный, интерпретируемый или JIT-компилируемый, объектно-ориентированный язык с функциями первого класса."},{"_id":"5ff63caec07c64c6d0794702","term":"PHP","definition":"Это распространенный язык программирования общего назначения с открытым исходным кодом. PHP специально сконструирован для веб-разработок и его код может внедряться непосредственно в HTML. "},{"_id":"5ff63caec07c6466a6794703","term":"Типизация","definition":"Процесс определения языком типа каких-либо данных."},{"_id":"5ff63caec07c641583794704","term":"Компилятор","definition":"Программа, преобразующая один язык программирования в другой."},{"_id":"5ff63caec07c64213b794705","term":"Среда разработки","definition":"Набор средств и инструментов, используемых для разработки программного обеспечения."},{"_id":"5ff63caec07c642e7f794706","term":"Abstract syntax tree","definition":"(Абстрактное синтаксическое дерево) резульатат разбора программы на более удобные для представления языковые инструкции."},{"_id":"5ff63caec07c641e8e794707","term":"Граф","definition":"Конечная совокупность точек, некоторые из которых соединены друг с другом линиями, называемыми ребрами."},{"_id":"5ff63caec07c64fd8f794708","term":"Машинный код","definition":"Набор чисел, который интерпретируется процессором компьютера и определяет выполняемые им действия."},{"_id":"5ff63caec07c64d0a4794709","term":"Виртуальная машина","definition":"Это компьютерный файл (обычно его называют образом), который действует как обычный компьютер. Другими словами, на компьютере создается еще один компьютер."},{"_id":"5ff63caec07c64494679470a","term":"Abstract syntax tree","definition":"(Абстрактное синтаксическое дерево) резульатат разбора программы на более удобные для представления языковые инструкции."},{"_id":"5ff63caec07c645e8079470b","term":"Машинный код","definition":"Набор чисел, которые интерпретируются процессором компьютера и определяют выполняемые им действия."},{"_id":"5ff63caec07c64769979470c","term":"Веб приложение","definition":"Динамически изменяющаяся совокупность систем, обладающая интерактивным интерфейсом."},{"_id":"5ff63caec07c64320d79470d","term":"API","definition":"(Application programming interface) cпособ взаимодействия с определенной компьютерной программой или интернет сервисом."},{"_id":"5ff63caec07c6420a579470e","term":"Производительность","definition":"Это объективные измерения и восприятие пользователем времени загрузки и времени выполнения."},{"_id":"5ff63caec07c64f6da79470f","term":"Статическая типизация","definition":"Типизация, при которой тип переменной фиксируется во время компиляции."},{"_id":"5ff63caec07c6432ee794710","term":"Динамическая типизация","definition":"Типизация, при которой тип переменной определяется во время выполнения программы."},{"_id":"5ff63caec07c64c5c4794711","term":"Строгая типизация","definition":"Типизация, при которой несоответствие типа переменной реальному типу назначенного ей значения приведет к ошибке."},{"_id":"5ff63caec07c64eec0794712","term":"Слабая типизация","definition":"Типизация, при которой в соблюдении соответствий типов нет необходимости. Чаще всего, при таком виде типизации выполняется приведение переменных к требуемым типам."},{"_id":"5ff63caec07c647a59794713","term":"Язык программирования","definition":"Формальный язык для представления алгоритмов, ориентированных на выполнение с помощью компьютера."},{"_id":"60019d967f5ab5dcbdb93909","term":null,"definition":null},{"_id":"60019f647f5ab55399b9390a","term":"Google","definition":"Американская транснациональная корпорация, реорганизованная 15 октября 2015 года в международный конгломерат Alphabet Inc."}]